###  교착상태(Deadlock) 해결 방법 리포트

```markdown
[Bug] Deadlock - 멀티스레드 자원 순환 대기로 인한 프로세스 무응답(Hang) 장애
```

#### 1.  교착 상태 예방
- 일반적으로 자원 사용 효율성이 좋지 않고 비용이 많이 들어 사용이 적은 방법
- 자원 낭비가 가장 심함 방법
    - 교착 상태를 원전적으로 봉쇄하는 상황에서는 사용(중환자실, 747제어 등(비행기))
- 교착상태가 발생하지 않도록 발생 조건 중 하나를 제거

  * **상호 배제 조건 제거** : (ex. 하나의 프린터에서 2개의 인쇄 동시 불가능) , 즉 현실적으로 불가능
  * **점유 대기 조건 제거** : 주기적으로 어떤 자원을 필요로 하는지 점검함 ==> 점검하는데 추가적인 오버헤드가 발생 => 효율성 다운
    - 프로세스가 모든 자원을 한 번에 요구 => 대기 조건 X 
    - but 필요 없는 시점에 자원을 미리 할당하기 때문에 효율성 다운
  * **비선점 조건 제거** : 자신이 가지고 있던 자원을 반납 => 단점: 작업 상태를 잃을 수 있음
  * **순환 대기 조건 제거** : 각각의 자원에 고유번호를 할당/ 특정 프로세스는 자신이 부여받은 자원의 번호를 기준으로 오름차순 혹은 내림차순으로만 요청이 가능
    - 예방 과정에서 가장 많이 사용 
    - but 필요 없는 시점에 자원을 미리 확보하기 때문에 효율성 다운

           
  * 현상: 4대의 차량이 각각 1개의 구역을 점유(Hold)한 채, 
          상대방이 점유한 다음 구역을 무한히 대기(Wait)하여 
          모든 차량이 오도 가도 못하는 '교착상태(Deadlock)' 발생
순환 대기 조건 <아키텍처 그림 추가>

#### 2.  Deadlock 회피 
- 실행 환경에서 추가 정보(리소스)를 활용해 교착상태 발생 가능성을 검사 => 발생 가능성 존재 시 사전에 회피
    - 은행원 알고리즘
        - 기본과정
            - 프로세스가 자원 요청시, 자원을 할당한 후에도 안정상태로 남아있는지 사전 검사.
            - 이때 안정상태면 자원 할당 / 불안정 상태면 다른 프로세스가 자원을 해지 할 때까지 대기
            <아키텍처 그림 추가>

        - 자원을 요청할 때 마다 시스템 상태를 검사하기 때문에 오버헤드가 높음

#### 3. Deadlock 탐지 및 회복(주로 많이 사용하는 방법)
- 교착 상태를 허용하지만 => **상태를 탐지하고 회복하는 방법**
- 알고리즘을 주기적으로 실행 => 시스템에 발생한 Deadlock을 체크하고 회복
- 자원 할당 그래프 알고리즘 사용
    - 그래프 상에 교착 상태를 유발시키는 순환 사이클의 존재 유무 체크

    * **방법 1 프로세스 종료**
        * 교착 상태의 프로세스를 모두 중지 => 가장 간편 but 현재까지의 내용 유실 위험 존재
        * 교착상태가 제거 될 때까지 한 프로세스씩 중지 => 똑같이 중지하고 검사하는것을 반복하기 때문에 오버헤드가 높음

    * **방법 2 자원선점(리소스의 일시적 선정 허용)**
        * 교착 상태가 제거될때까지 프로세스가 점유한 자원을 선점해 다른 프로세스에게 할당

#### 4. Deadlock 무시
- 교착 상태 자체를 무시, 특별한 조치X
- 발생 확률이 낮은 상황에서 주로 사용


